_sdaiWriteRepositoryToFile(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Saves a specified repository to a file.
\param repository [in] A repository instance.
\param fileName [in] A string that contains the name of the file where the contents of the repository are saved.
\returns sdaiTRUE if the repository was successfully saved into the file; otherwise, the function return sdaiFALSE.